{
  "progress": [
    {
      "id": 1,
      "assignDate": "2014-06-11",
      "assignee": "Trilarion",
      "category": 1,
      "description": "Rules: The game specification is an extensive document describing all the various details of the game and how they interact. It needs public discussion and constant revising. But first it should be in a draft like state at least mentioning all the important parts as detailed as possible. In the next 2-3 months finish it and then publish it for public discussion.",
      "title": "Finish first comprehensive version of game specification",
      "dependencies": [],
      "creationDate": "2014-06-11"
    },
    {
      "id": 20,
      "assignDate": "2014-09-16",
      "assignee": "",
      "category": 1,
      "description": "This is not a task but a milestone. It will be marked completed automatically if the following state is reached: workable first version of editor, selection of a scenario and simple play (making turns, inspecting various screens, doing some stuff with it).",
      "title": "Milestone: 0.3",
      "dependencies": [],
      "creationDate": "2014-09-16"
    },
    {
      "id": 14,
      "assignDate": "2014-09-08",
      "assignee": "Trilarion",
      "category": 3,
      "description": "The map is a central piece of the UI. Many layers (terrain, ressources, rivers, grid, borders, units, cities) need to be painted. Also the nations must be made customizable (color, name, ...).",
      "title": "UI: Improve the Editor screen, implement map view and edit nations dialog",
      "dependencies": [],
      "creationDate": "2014-09-08"
    },
    {
      "id": 24,
      "assignDate": "2014-09-21",
      "assignee": "Earymgn",
      "category": 3,
      "description": "Create a nicely looking visualization that displays the dependencies and all important information of the techs. Displayable properties might be: name of tech, year of introduction, costs of research, dependencies, icons for what is gained. Use placeholders for any real needed graphics.",
      "title": "UI: Visualization of the tech tree",
      "dependencies": [],
      "creationDate": "2014-09-21"
    }
  ],
  "completed": [
    {
      "id": 2,
      "assignDate": "2014-06-11",
      "result": "A new version (0.2.0) using Python and the PySide Qt bindings has been released. It is roughly feature equivalent to the last Java version.",
      "completionDate": "2014-09-08",
      "assignee": "Trilarion",
      "creationDate": "2014-06-11",
      "description": "The last Java version (0.1.4) had a functional start screen, a preliminary editor showing a map and a game center dialog allowing to choose a scenario. All these features will very likely be part of the final game design because they are so essential. In order to release a Python version a Python version with roughly the same features should be created. This will attract attention to the project and allows us to test the Python release pathways. Do not include more features for now but rather break them down to individual tasks later.",
      "title": "Release: Bring Python version of the game roughly to the state of the last Java version",
      "dependencies": [],
      "category": 3
    }
  ],
  "properties": {
    "pageTitle": "Imperialism Remake Taskboard",
    "categories": [
      "General",
      "Artwork",
      "Programming"
    ]
  },
  "available": [
    {
      "id": 3,
      "creationDate": "2014-06-12",
      "description": "Create a list of all sound effects likely to be needed. See <a href=\"http://remake.twelvepm.de/forum/viewtopic.php?f=8&t=1067\">here</a> for more information.",
      "title": "Music: Compile a list of all sound effects likely to be used",
      "dependencies": [],
      "category": 1
    },
    {
      "id": 12,
      "creationDate": "2014-06-12",
      "description": "Create a table giving each button a short but meaningful name and explain in one short sentence the function of each button. Indicate if the size is different from the standard size.",
      "title": "UI: Compile a list of buttons that will most probably be needed in the game",
      "dependencies": [],
      "category": 1
    },
    {
      "id": 23,
      "creationDate": "2014-09-18",
      "description": "Starting from the discussion in the forum about the tech tree, create a workable proposal for the techtree. In the end it will be discussed and inserted in the Game Definition document.",
      "title": "Definition: Detailed proposal for a tech tree",
      "dependencies": [],
      "category": 1
    },
    {
      "id": 11,
      "creationDate": "2014-06-12",
      "description": "We could need a few more. Refer to the forum for discussions about the style. Please do not forget to provide a license agreement and as much raw (notation) data as possible.",
      "title": "Music: Compose a few more pieces of background music",
      "dependencies": [],
      "category": 2
    },
    {
      "id": 13,
      "creationDate": "2014-06-12",
      "description": "We need a common style for button. Please refer to the forum for discussions about the style. Please do not forget to provide a license agreement and as much raw (notation) data as possible.",
      "title": "UI: Develop a common design for buttons",
      "dependencies": [],
      "category": 2
    },
    {
      "id": 18,
      "creationDate": "2014-09-10",
      "description": "There are many backgrounds that need to be filled. We need a common design for them. This probably needs some discussion. Woodlike/metal or a blurred map are ideas that might be of interest.",
      "title": "UI: Develop a common design for backgrounds of windows, button, elements, ...",
      "dependencies": [],
      "category": 2
    },
    {
      "id": 21,
      "creationDate": "2014-09-16",
      "description": "Create a short video (1-2 minutes) which can be used as a trailer, intro, advertisment video. Use music and graphics from the artwork of the project.",
      "title": "Video: Create an introductory video",
      "dependencies": [],
      "category": 2
    },
    {
      "id": 5,
      "creationDate": "2014-06-12",
      "description": "For specifications have a look at the Game Definition Manual. No fancy graphics. Just a QGraphicsView for the battlefield, a toolbar above and a logging message QTextEdit below.",
      "title": "Battle Prototype: Create a GUI drawing a battle field and allowing to move place some units on it",
      "dependencies": [],
      "category": 3
    },
    {
      "id": 15,
      "creationDate": "2014-09-09",
      "description": "For specifications have a look at the Game Definition Manual. No fancy graphics. Just a QWidget that has all the necessary fields.",
      "title": "Trade Prototype: Create a GUI for allowing to set up trade preferences with different trade partners and resources",
      "dependencies": [],
      "category": 3
    },
    {
      "id": 16,
      "creationDate": "2014-09-09",
      "description": "The project definitely needs more tests to run automatically. While there is currently only audio and some GUI in PySide there are possibilities to write more tests. Do it.",
      "title": "Tests: Write more tests",
      "dependencies": [],
      "category": 3
    },
    {
      "id": 17,
      "creationDate": "2014-09-10",
      "description": "Sound effects will very probably be available in the wav format but may need cutting. Furthermore they must be compiled into a single ogg file (using an external encode on Windows). Automatize this. Then this file must be read and chunks from it must be played upon request and with minimal delay.",
      "title": "Music: Combining sound effects in one file and playing from this one file",
      "dependencies": [],
      "category": 3
    },
    {
      "id": 19,
      "creationDate": "2014-09-10",
      "description": "The designers will choose a font. Modify the GUI so that this font is used throughout the game.",
      "title": "UI: Implement a specific font",
      "dependencies": [],
      "category": 3
    },
    {
      "id": 25,
      "creationDate": "2014-09-21",
      "description": "Explore possibilities for automatized installation via shell script, python egg(?), debian package, .... The packaging process itself should be automatized too and the compatible Linux distros be named.",
      "title": "Linux: Create package or installer",
      "dependencies": [],
      "category": 3
    },
    {
      "id": 26,
      "creationDate": "2014-09-21",
      "description": "Explore possibilities for automatized installation on a computer running MacOS. The packaging process itself should be automatized too.",
      "title": "MacOS: Create package or installer",
      "dependencies": [],
      "category": 3
    }
  ],
  "blocked": [
    {
      "id": 4,
      "creationDate": "2014-06-12",
      "description": "Search and find sound effect samples that can be used for the sound effects listed in the dependent task. Indicate time ranges within the files if reasonable. See <a href=\"http://remake.twelvepm.de/forum/viewtopic.php?f=8&t=1067\">here</a> for more information.",
      "title": "Music: Compile a repository of sound effect files under compatible licenses",
      "dependencies": [
        3
      ],
      "category": 2
    },
    {
      "id": 6,
      "creationDate": "2014-06-12",
      "description": "For specifications have a loot at the Game Definition Manual. An army is a list of units each with their respective stats and position on the battlefield. Load/save army to file.",
      "title": "Battle Prototype: Create internal data structures to hold armies",
      "dependencies": [
        5
      ],
      "category": 3
    },
    {
      "id": 7,
      "creationDate": "2014-06-12",
      "description": "Again nothing fancy, just the bare minimum so that it works.",
      "title": "Battle Prototype: Create GUI to load/save/create new army",
      "dependencies": [
        6
      ],
      "category": 3
    },
    {
      "id": 8,
      "creationDate": "2014-06-12",
      "description": "We also need a small info panel showing the units stats.",
      "title": "Battle Prototype: Implement turns, selection and move of units",
      "dependencies": [
        7
      ],
      "category": 3
    },
    {
      "id": 9,
      "creationDate": "2014-06-12",
      "description": "For specifications have a loot at the Game Definition Manual.",
      "title": "Battle Prototype: Implement attacking of units",
      "dependencies": [
        8
      ],
      "category": 3
    },
    {
      "id": 10,
      "creationDate": "2014-06-12",
      "description": "Try to develop a simple one. Let it run against each other and against humans.",
      "title": "Battle Prototype: Experiment with combat AI",
      "dependencies": [
        9
      ],
      "category": 3
    },
    {
      "id": 22,
      "creationDate": "2014-09-16",
      "description": "Currently they go square like according to the tile boundaries. Make them a bit random and smooth, rounding any hard corners.",
      "title": "UI: Smooth areas, country borders, province borders",
      "dependencies": [
        14
      ],
      "category": 3
    },
    {
      "id": 27,
      "creationDate": "2014-09-22",
      "description": "Rivers are currently a list of neighbored tile positions and only crudely painted. Display them nicely as smooth line with random turns (use correlated random displacement on a finer length scale) and increasing width from the source. Use a texture or a multi-color brush for painting.",
      "title": "UI: Smooth display of rivers",
      "dependencies": [
        14
      ],
      "category": 3
    },
    {
      "id": 28,
      "creationDate": "2014-09-22",
      "description": "This is a difficult task. Produce a smooth display of borders (provinces, nations), shores, areas of equal terrain. The difficulty is that neighbored regions etc. must still share the same border after smoothing.",
      "title": "UI: Smooth display of borders and landscapes",
      "dependencies": [
        14
      ],
      "category": 3
    }
  ]
}